eisup_2019_docmng_integration/src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций/ОсновныеНачисленияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисленияОрганизаций</name>
  <comment>(Регл)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</baseCalculationTypes>
  <predefined>
    <items>
      <name>ОплатаБЛПоТравмеВБыту</name>
      <description>БЛ по травме в быту (не оплачивается)</description>
    </items>
    <items>
      <name>ДниНеоплачиваемыеСогласноТабелю</name>
      <description>Дни неоплачиваемые согласно табелю</description>
    </items>
    <items>
      <name>ДоплатаЗаВечерниеЧасы</name>
      <description>Доплата за вечерние часы</description>
    </items>
    <items>
      <name>ДоплатаЗаНочныеЧасы</name>
      <description>Доплата за ночные часы</description>
    </items>
    <items>
      <name>ДоплатаЗаПраздничныеИВыходные</name>
      <description>Доплата за работу в праздники и выходные</description>
    </items>
    <items>
      <name>ДоплатаПоСреднемуБЛ</name>
      <description>Доплата по больничным листам</description>
    </items>
    <items>
      <name>ОтпускБезОплатыУчебный</name>
      <description>Дополнительный учебный отпуск без оплаты</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>ОкладПоЧасам</name>
      <description>Оклад по часам</description>
    </items>
    <items>
      <name>ОплатаБЛПоТравмеНаПроизводстве</name>
      <description>Оплата БЛ по травме на производстве</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуБЛ</name>
      <description>Оплата больничных листов</description>
    </items>
    <items>
      <name>ОплатаВыходныхДнейПоУходуЗаДетьмиИнвалидами</name>
      <description>Оплата дополнительных выходных дней по уходу за детьми - инвалидами</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтпКалендарныеДни</name>
      <description>Оплата отпуска по календарным дням</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуОтпШестидневка</name>
      <description>Оплата отпуска по шестидневке</description>
    </items>
    <items>
      <name>ТарифДневной</name>
      <description>Оплата по дневному тарифу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Оплата по производственным нарядам</description>
    </items>
    <items>
      <name>ОплатаПоСреднему</name>
      <description>Оплата по среднему заработку</description>
    </items>
    <items>
      <name>ТарифЧасовой</name>
      <description>Оплата по часовому тарифу</description>
    </items>
    <items>
      <name>ПочасовойПростойОкладПоЧасам</name>
      <description>Оплата почасового простоя от оклада по часам</description>
    </items>
    <items>
      <name>ПочасовойПростойТарифЧасовой</name>
      <description>Оплата почасового простоя по часовому тарифу</description>
    </items>
    <items>
      <name>ОплатаПраздничныхИВыходных</name>
      <description>Оплата праздничных и выходных дней</description>
    </items>
    <items>
      <name>ПростойОкладПоДням</name>
      <description>Оплата простоя от оклада по дням</description>
    </items>
    <items>
      <name>ПростойОкладПоЧасам</name>
      <description>Оплата простоя от оклада по часам</description>
    </items>
    <items>
      <name>ПростойТарифДневной</name>
      <description>Оплата простоя по дневному тарифу</description>
    </items>
    <items>
      <name>ПростойТарифЧасовой</name>
      <description>Оплата простоя по часовому тарифу</description>
    </items>
    <items>
      <name>ОплатаСверхурочных</name>
      <description>Оплата сверхурочных часов</description>
    </items>
    <items>
      <name>ОтпускБезОплатыПоТКРФ</name>
      <description>Отпуск без оплаты согласно ТК РФ</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчет</name>
      <description>Отпуск за свой счет</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенкомБезОплаты</name>
      <description>Отпуск по уходу за ребенком без оплаты</description>
    </items>
    <items>
      <name>ОтсутствиеПоБолезни</name>
      <description>Отсутствие по болезни</description>
    </items>
    <items>
      <name>ОтсутствиеПоБолезниПоБеременности</name>
      <description>Отсутствие по болезни (по беременности и родам)</description>
    </items>
    <items>
      <name>Невыход</name>
      <description>Отсутствие по невыясненной причине</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо1_5Лет</name>
      <description>Пособие по уходу за ребёнком до 1.5 лет</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо3Лет</name>
      <description>Пособие по уходу за ребёнком до 3 лет</description>
    </items>
    <items>
      <name>ПочасовойПростойПоВинеРаботодателя</name>
      <description>Почасовой простой по вине работодателя</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул, простой по вине работника</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой по вине работодателя</description>
    </items>
    <items>
      <name>РайонныйКоэффициент</name>
      <description>Районный коэффициент</description>
    </items>
    <items>
      <name>СевернаяНадбавка</name>
      <description>Северная надбавка</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетНормыВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОтраженияВУчете</name>
    <type>
      <types>EnumRef.СтратегииОтраженияВРеглУчетеНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтнесениеРасходовКДеятельностиЕНВД</name>
    <type>
      <types>EnumRef.ОтнесениеРасходовКДеятельностиЕНВД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияПоСт255НК</name>
    <type>
      <types>EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаЕСН</name>
    <type>
      <types>CatalogRef.ДоходыЕСН</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.ДоходыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаФСС_НС</name>
    <type>
      <types>EnumRef.ДоходыФСС_НС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоходомВНатуральнойФорме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКатегорияРасчета</name>
    <type>
      <types>EnumRef.УдалитьКатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</name>
    <type>
      <types>EnumRef.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаСреднегоЗаработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеВТабелеУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.КлассификаторИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентСтажа</name>
    <type>
      <types>CatalogRef.КоэффициентыСтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетВводаТарифногоРазряда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоказатель1</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоказатель2</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоказатель3</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоказатель4</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоказатель5</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноПодпадаетПодЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяФормулаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПособияСоциальногоСтрахования</name>
    <type>
      <types>EnumRef.ВидыПособийСоциальногоСтрахования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажаСЗВ4</name>
    <type>
      <types>EnumRef.ВидыСтажаСЗВ4</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЕжегодногоОтпуска</name>
    <type>
      <types>CatalogRef.ВидыЕжегодныхОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВУпрУчете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>CatalogRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачисляетсяВЦеломЗаМесяц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоНачислятьПоТабелю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаСтраховыеВзносы</name>
    <type>
      <types>CatalogRef.ДоходыПоСтраховымВзносам</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСхемМотивации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиватьПриКадровыхПеремещениях</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

eisup_2019_docmng_integration/src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СтратегииОтраженияВРеглУчетеНачислений/СтратегииОтраженияВРеглУчетеНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтратегииОтраженияВРеглУчетеНачислений</name>
  <enumValues>
    <name>КакЗаданоВидуРасчета</name>
  </enumValues>
  <enumValues>
    <name>КакЗаданоНаНачалоСобытия</name>
  </enumValues>
  <enumValues>
    <name>КакБазовыеНачисления</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка/ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</name>
  <enumValues>
    <name>ПоТрудовомуЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>ПоКолдоговору</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет обновление реквизитов "ЗачетОтработанногоВремени" и
// "ЗачетНормыВремени" в зависимости от значения ОбозначениеВТабелеУчетаРабочегоВремени.ВидВремени
//
// Параметры:
//  Нет.
//
Процедура ОбновитьПризнакиУчетаВремени() Экспорт

	ЭтоРасчетПроцентом = СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом 
							Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом
							Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СевернаяНадбавка;
							
	Если Не ЭтоРасчетПроцентом Тогда
		Для Каждого Показатель Из Показатели Цикл
			
			Если Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБаза Тогда
				ЭтоРасчетПроцентом = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;							
							
							
	Если ЭтоРасчетПроцентом Тогда
        Если ОбозначениеВТабелеУчетаРабочегоВремени.Пустая() Тогда
			ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
		КонецЕсли;
		Если ВидВремени.Пустая() Тогда
			ВидВремени = Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы
		КонецЕсли;
	КонецЕсли;
	
	Если ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени 			= Истина;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени 			= Ложь;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное Тогда
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Истина;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное Тогда
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Истина;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени			= Истина;
	Иначе
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура УточнитьСтратегиюОтраженияВУчете() Экспорт
	
	ЭтоПособиеЗаСчетФСС = Ссылка = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ
								Или Ссылка = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам
								Или Ссылка = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеПоУходуЗаРебенкомДо1_5Лет;

	Если Не ЭтоПособиеЗаСчетФСС Тогда
		СтратегияОтраженияВУчете = ?(СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.РаспределятьПоБазовымНачислениям,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления,?(СпособОтраженияВБухучете.Пустая(), Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоВидуРасчета));	
	КонецЕсли;							
								
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
    Если ОбъектКопирования.Предопределенный Тогда
		ТЧ = ВытесняющиеВидыРасчета.Выгрузить();
		ТЧ.ЗаполнитьЗначения(Ложь,"Предопределенный");
		ВытесняющиеВидыРасчета.Загрузить(ТЧ);
	КонецЕсли;
	КодДоходаНДФЛ	= ОбъектКопирования.КодДоходаНДФЛ;
	КодДоходаЕСН	= ОбъектКопирования.КодДоходаЕСН;
	КодДоходаСтраховыеВзносы = ОбъектКопирования.КодДоходаСтраховыеВзносы;
	КодДоходаФСС_НС	= ОбъектКопирования.КодДоходаФСС_НС;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Перечисления.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоТрудовомуЗаконодательству Тогда
		ПериодРасчетаСреднегоЗаработка = 0
	КонецЕсли;
	
	// Обновим реквизиты "ЗачетОтработанногоВремени" и "ЗачетНормыВремени"
	ОбновитьПризнакиУчетаВремени();	
	УточнитьСтратегиюОтраженияВУчете();
	
	Если ПроизвольнаяФормулаРасчета И СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
		СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	КонецЕсли;
	
	НачисляетсяВЦеломЗаМесяц = ПроведениеРасчетов.УстановитьФлагНачисляетсяВЦеломЗаМесяц(ПроизвольнаяФормулаРасчета, Показатели, СпособРасчета, ПериодДействияБазовый);

	Если НЕ ((ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)
		 ИЛИ (ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы)) Тогда
		АвтоНачислятьПоТабелю = Ложь;
	КонецЕсли;
	
	ОсновныеНачисленияОрганизацийПереопределяемый.ПередЗаписьюДополнительно(ЭтотОбъект);
                  
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда // проверки не выполняем
		Возврат
	КонецЕсли;
	
	Если ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы Тогда
		Если (ОбозначениеВТабелеУчетаРабочегоВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
			И ОбозначениеВТабелеУчетаРабочегоВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ВидВремени) и ВидВремени <> Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы Тогда
		Если ОбозначениеВТабелеУчетаРабочегоВремени.Пустая() Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Для начисления, по которому регистрируется отработанное (или неотработанное время), необходимо задать конкретный вид времени по классификатору использования рабочего времени!", Отказ);
		ИначеЕсли (ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное 
			Или ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное) и ОбозначениеВТабелеУчетаРабочегоВремени.РабочееВремя Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		ИначеЕсли (ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы 
			Или ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы) и Не ОбозначениеВТабелеУчетаРабочегоВремени.РабочееВремя Тогда 
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если АвтоНачислятьПоТабелю Тогда
		
		// с указанным видом времени должен быть только один с признаком автоначисления по табелю
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбозначениеВТабелеУчетаРабочегоВремени", ОбозначениеВТабелеУчетаРабочегоВремени);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизаций.Ссылка
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени = &ОбозначениеВТабелеУчетаРабочегоВремени
		|	И ОсновныеНачисленияОрганизаций.АвтоНачислятьПоТабелю
		|	И ОсновныеНачисленияОрганизаций.Ссылка <> &Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Для обозначения в табеле рабочего времени " + ОбозначениеВТабелеУчетаРабочегоВремени + " уже существует вид расчета " + Выборка.Ссылка + " с признаком автоначисления по табелю!", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	
	// Описание текста запроса:
	// Первая часть запроса - поиск видов расчета, которые вытесняЮт текущий, являющийся почасовым отклонением: 
	//		Выбираются виды расчета, которые вытесняЕт текущий, проверяется отсутствие таких видов
	//
	// Вторая часть запроса - поиск видов расчета, которые вытесняЕт текущий, являющийся почасовым отклонением: 
	//		Выбираются виды расчета, которые вытесняЕт текущий, проверяется отсутствие таких видов
	//
	// Третья часть запроса - поиск видов расчета, являющихся почасовыми отклонениями, которые вытесняЮт текущий: 
	//		Для вида расчета, не являющегося почасовым отклонением, поиск вытесняющий его видов - почасовых отклонений
	// 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСсылка", Ссылка);
	НецелосменноеВремя = Новый Массив;
	НецелосменноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	НецелосменноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("НецелосменноеВремя", НецелосменноеВремя);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Для нецелодевных начислений нельзя назначать вытесняющие виды расчета"" КАК ОписаниеКонфликта
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*) КАК КоличествоВР
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняющиеВР
	|	ГДЕ
	|		ВытесняющиеВР.Ссылка = &парамСсылка
	|		И ВытесняющиеВР.Ссылка.ВидВремени В(&НецелосменноеВремя)) КАК ДанныеПоВытесняющимВР
	|ГДЕ
	|	ДанныеПоВытесняющимВР.КоличествоВР > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Недопустимо назначение нецелодевного начисления '"" + ОсновныеНачисления.Ссылка.Наименование + ""' как вытесняющего для '"" + ВытесняемыеНачисления.Ссылка.Наименование + ""'""
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняемыеНачисления
	|		ПО ОсновныеНачисления.Ссылка = ВытесняемыеНачисления.ВидРасчета
	|ГДЕ
	|	ОсновныеНачисления.Ссылка = &парамСсылка
	|	И ОсновныеНачисления.ВидВремени В(&НецелосменноеВремя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Недопустимо назначение нецелодевного начисления '"" + ВытесняющиеВР.ВидРасчета.Наименование + ""' в качестве вытесняющего вида расчета""
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняющиеВР
	|ГДЕ
	|	ВытесняющиеВР.Ссылка = &парамСсылка
	|	И ВытесняющиеВР.ВидРасчета.ВидВремени В(&НецелосменноеВремя)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОписаниеКонфликта) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке(Выборка.ОписаниеКонфликта, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
